### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

## Three observable trends based on the data"

* The majority of the people purchasing optional items are male players(84.03%)
* 76.74% of the players ages range between 15 to 29 years old and 44.79% are within the ages of 20 to 24. 
* "Final Critic" and "Outbreaker, Last Hope of the Breaking Storm" are the most popular and profitable items.

In [2]:
# Dependencies and Setup
import pandas as pd
import os


# File to Load (Remember to Change These)
file_to_load = ("Resources/purchase_data.csv")

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [3]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
purchase_data.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [5]:
purchase_data.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [6]:
purchase_data["SN"].value_counts()

Lisosia93      5
Iral74         4
Idastidru52    4
Asur53         3
Chamimla85     3
              ..
Layjask75      1
Ina92          1
Chamast86      1
Assassa81      1
Lisico81       1
Name: SN, Length: 576, dtype: int64

In [7]:
players_count = len(purchase_data["SN"].unique())
players_count

576

In [8]:
summary_player = pd.DataFrame({"Total Players": [players_count]})
summary_player

   Total Players
0            576

## Player Count

* Display the total number of players

In [9]:
players_count = len(purchase_data["SN"].unique())
players_count

576

In [10]:
summary_player = pd.DataFrame({"Total Players": [players_count]})
summary_player

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [11]:
number_items = len(purchase_data["Item Name"].unique())
number_items

179

In [12]:
average_df = purchase_data["Price"].mean()
average_df

3.050987179487176

In [13]:
purchase_number = purchase_data["Purchase ID"].count()
purchase_number

780

In [14]:
revenue_suma = purchase_data["Price"].sum()
revenue_suma

2379.77

In [15]:
summary_rev = pd.DataFrame({"Number of Unique Items": [number_items],"Average Price": average_df,
                              "Number of Purchase": purchase_number,
                              "Total Revenue": revenue_suma})
summary_rev.style.format({"Average Price": "${:.2f}", "Total Revenue": "${:,.2f}"})

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [16]:
gendertable = purchase_data[['Gender','SN','Price']]
gendertable.head()

  Gender             SN  Price
0   Male        Lisim78   3.53
1   Male    Lisovynya38   1.56
2   Male     Ithergue48   4.88
3   Male  Chamassasya86   3.27
4   Male      Iskosia90   1.44

In [17]:
gendertable['Gender'].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [18]:
players_number = len(gendertable["SN"].unique())
players_number

576

In [19]:
male_players = gendertable[gendertable['Gender'] == 'Male']["SN"].nunique()
male_percentage = male_players/players_number*100

male_percentage

84.02777777777779

In [20]:
female_players = gendertable[gendertable['Gender'] == 'Female']["SN"].nunique()
female_percentage = female_players/players_number*100

In [21]:
other_players = gendertable[gendertable['Gender'] == 'Other / Non-Disclosed']["SN"].nunique()
other_percentage = other_players/players_number*100

In [22]:
gen_demographics = pd.DataFrame({"Gender":["Male", "Female", "Other / Non-Disclose"],"Total Count":[male_players, female_players, other_players], 
                                 "Percentage of Players": [male_percentage, female_percentage, other_percentage]}) 

gen_demographics = gen_demographics.set_index('Gender')
gen_demographics["Percentage of Players"] = gen_demographics["Percentage of Players"].map ("{:.2f}%".format)
gen_demographics.head()

                      Total Count Percentage of Players
Gender
Male                          484                84.03%
Female                         81                14.06%
Other / Non-Disclose           11                 1.91%

# tried to do the same using a for loop

In [23]:

gender_unique = gendertable['Gender'].unique()
players_number = len(gendertable["SN"].unique())
# HERE YOU CAN DO column_names = ["Gender", "Total Count", "Percentage of Players"]
# Replace columns = with column names 
# Then in your for loop you can use zip to do the rest. So something like zip(columns_names, list(x, y, z))
gen_demographics = pd.DataFrame(columns = ["Gender", "Total Count", "Percentage of Players"])
for Gender in gender_unique:
    
    players = gendertable[gendertable['Gender'] == Gender]["SN"].nunique()
    percentage = players/players_number*100
    data = {'Gender': Gender, 'Total Count': players, 'Percentage of Players': percentage}
    gen_demographics = gen_demographics.append(data, ignore_index =True)
    
print(gen_demographics)

                  Gender Total Count  Percentage of Players
0                   Male         484              84.027778
1  Other / Non-Disclosed          11               1.909722
2                 Female          81              14.062500


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [24]:
male_purchase = gendertable[gendertable['Gender'] == 'Male']["Price"].count()
male_average = gendertable[gendertable['Gender'] == 'Male']["Price"].mean()
male_total = gendertable[gendertable['Gender'] == 'Male']["Price"].sum()
male_per = male_total/male_players
male_per

4.065371900826446

In [25]:
female_purchase = gendertable[gendertable['Gender'] == 'Female']["Price"].count()
female_average = gendertable[gendertable['Gender'] == 'Female']["Price"].mean()
female_total = gendertable[gendertable['Gender'] == 'Female']["Price"].sum()
female_per = female_total/female_players
female_per

4.468395061728395

In [26]:
other_purchase = gendertable[gendertable['Gender'] == 'Other / Non-Disclosed']["Price"].count()
other_average = gendertable[gendertable['Gender'] == 'Other / Non-Disclosed']["Price"].mean()
other_total = gendertable[gendertable['Gender'] == 'Other / Non-Disclosed']["Price"].sum()
other_per = other_total/other_players
other_per

4.5627272727272725

In [27]:
purchasing_analysis = pd.DataFrame({"Gender":["Male", "Female", "Other / Non-Disclosed"],"Purchase Count":[male_purchase, female_purchase, other_purchase], 
                                 "Average Purchase Price": [male_average, female_average, other_average], "Total Purchase Value":[male_total, female_total,
                                    other_total], "Avg Total Purchase per Person": [male_per, female_per, other_per]}) 

purchasing_analysis = purchasing_analysis.set_index('Gender')

purchasing_analysis["Average Purchase Price"] = purchasing_analysis["Average Purchase Price"].map("${:.2f}".format)
purchasing_analysis["Total Purchase Value"] = purchasing_analysis["Total Purchase Value"].map("${:,.2f}".format)
purchasing_analysis["Avg Total Purchase per Person"] = purchasing_analysis["Avg Total Purchase per Person"].map("${:.2f}".format)
purchasing_analysis.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Male,652,$3.02,"$1,967.64",$4.07
Female,113,$3.20,$361.94,$4.47
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [28]:
age_table = purchase_data[['SN','Age']]
age_table.head()

              SN  Age
0        Lisim78   20
1    Lisovynya38   40
2     Ithergue48   24
3  Chamassasya86   24
4      Iskosia90   23

In [29]:
print(age_table["Age"].max())
print(age_table["Age"].min())

45
7

In [30]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
Age_labels = ["<10","10-14", "15-19", "20-24", "25-29", "30-34", "35-39","40+" ]

In [31]:
age_table["Age Range"]= pd.cut(age_table["Age"], bins, labels=Age_labels)
age_table

C:\Users\zorta\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

                SN  Age Age Range
0          Lisim78   20     20-24
1      Lisovynya38   40       40+
2       Ithergue48   24     20-24
3    Chamassasya86   24     20-24
4        Iskosia90   23     20-24
..             ...  ...       ...
775     Aethedru70   21     20-24
776         Iral74   21     20-24
777     Yathecal72   20     20-24
778        Sisur91    7       <10
779      Ennrian78   24     20-24

[780 rows x 3 columns]

In [32]:
new_age_demo = age_table.groupby("Age Range")
total_player_age = new_age_demo['SN'].nunique()
total_player_age

Age Range
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [33]:
player_age_percent = total_player_age/players_number*100
player_age_percent

Age Range
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: SN, dtype: float64

In [34]:
Age_demographics = pd.DataFrame({"Total Count":total_player_age,"Percentage of Players":player_age_percent})
Age_demographics["Percentage of Players"] = Age_demographics["Percentage of Players"].map("{:.2f}%".format)
Age_demographics

           Total Count Percentage of Players
Age Range
<10                 17                 2.95%
10-14               22                 3.82%
15-19              107                18.58%
20-24              258                44.79%
25-29               77                13.37%
30-34               52                 9.03%
35-39               31                 5.38%
40+                 12                 2.08%

In [35]:
print(type(total_player_age))
print(type([total_player_age]))

<class 'pandas.core.series.Series'>
<class 'list'>

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [36]:
Age_purchase = purchase_data[['SN','Age', 'Price']]
Age_purchase

                SN  Age  Price
0          Lisim78   20   3.53
1      Lisovynya38   40   1.56
2       Ithergue48   24   4.88
3    Chamassasya86   24   3.27
4        Iskosia90   23   1.44
..             ...  ...    ...
775     Aethedru70   21   3.54
776         Iral74   21   1.63
777     Yathecal72   20   3.46
778        Sisur91    7   4.19
779      Ennrian78   24   4.60

[780 rows x 3 columns]

In [37]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
Age_labels = ["<10","10-14", "15-19", "20-24", "25-29", "30-34", "35-39","40+" ]

In [38]:
Age_purchase["Age Range"]= pd.cut(Age_purchase["Age"], bins, labels=Age_labels)
Age_purchase

C:\Users\zorta\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

                SN  Age  Price Age Range
0          Lisim78   20   3.53     20-24
1      Lisovynya38   40   1.56       40+
2       Ithergue48   24   4.88     20-24
3    Chamassasya86   24   3.27     20-24
4        Iskosia90   23   1.44     20-24
..             ...  ...    ...       ...
775     Aethedru70   21   3.54     20-24
776         Iral74   21   1.63     20-24
777     Yathecal72   20   3.46     20-24
778        Sisur91    7   4.19       <10
779      Ennrian78   24   4.60     20-24

[780 rows x 4 columns]

In [39]:
new_age_purchase = Age_purchase.groupby("Age Range")
total_player_count = new_age_purchase['SN'].count()
total_player_count

Age Range
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: SN, dtype: int64

In [40]:
age_average_price = new_age_purchase['Price'].mean()
age_average_price

Age Range
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [41]:
age_sum_price = new_age_purchase['Price'].sum()
age_sum_price

Age Range
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [42]:
age_price_person = age_sum_price/total_player_age
age_price_person

Age Range
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [43]:
Age_purchasing = pd.DataFrame({"Purchase Count":total_player_count,"Average Purchase Price":age_average_price, "Total Purchase Value":
                              age_sum_price, "Avg Total Purchase per Person": age_price_person})
Age_purchasing["Average Purchase Price"] = Age_purchasing["Average Purchase Price"].map("${:.2f}".format)
Age_purchasing["Total Purchase Value"] = Age_purchasing["Total Purchase Value"].map("${:,.2f}".format)
Age_purchasing["Avg Total Purchase per Person"] = Age_purchasing["Avg Total Purchase per Person"].map("${:.2f}".format)
Age_purchasing

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Range,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [44]:
top_purchase = purchase_data[['SN','Age', 'Price']]
top_purchase

                SN  Age  Price
0          Lisim78   20   3.53
1      Lisovynya38   40   1.56
2       Ithergue48   24   4.88
3    Chamassasya86   24   3.27
4        Iskosia90   23   1.44
..             ...  ...    ...
775     Aethedru70   21   3.54
776         Iral74   21   1.63
777     Yathecal72   20   3.46
778        Sisur91    7   4.19
779      Ennrian78   24   4.60

[780 rows x 3 columns]

In [45]:
new_top_purchase = top_purchase.groupby("SN")
Spender_count=new_top_purchase['SN'].count()
Spender_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: SN, Length: 576, dtype: int64

In [46]:
Spender_price = new_top_purchase['Price'].mean()
Spender_price

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [47]:
Spender_sum = new_top_purchase['Item ID']==
Spender_sum

SyntaxError: invalid syntax (<ipython-input-47-a1f78ab047b5>, line 1)

In [48]:
Top_Spenders = pd.DataFrame({"Purchase Count":Spender_count,"Average Purchase Price":Spender_price, "Total Purchase Value":
                              Spender_sum})
Top_Spenders=Top_Spenders.sort_values("Total Purchase Value", ascending=False)
Top_Spenders["Average Purchase Price"] = Top_Spenders["Average Purchase Price"].map("${:.2f}".format)
Top_Spenders["Total Purchase Value"] = Top_Spenders["Total Purchase Value"].map("${:,.2f}".format)


Top_Spenders.head()

NameError: name 'Spender_sum' is not defined

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [49]:
items_df = purchase_data[['Item ID','Item Name', 'Price']]
items_df

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [50]:
items_group = items_df.groupby(['Item ID', 'Item Name'])
items_group.head()

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
764      113                          Solitude's Reaver   4.07
765      130                                      Alpha   2.07
766       58          Freak's Bite, Favor of Holy Might   4.14
777       67      Celeste, Incarnation of the Corrupted   3.46
779       50                                       Dawn   4.60

[690 rows x 3 columns]

In [51]:
item_count=items_group['Item Name'].count()
item_count

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Item Name, Length: 179, dtype: int64

In [52]:
item_total = items_group['Price'].sum()
item_total

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [53]:
item_price = items_group['Price'].unique().str[0]
item_price

Item ID  Item Name
0        Splinter                                        1.28
1        Crucifer                                        3.26
2        Verdict                                         2.48
3        Phantomlight                                    2.49
4        Bloodlord's Fetish                              1.70
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.23
179      Wolf, Promise of the Moonwalker                 4.48
181      Reaper's Toll                                   1.66
182      Toothpick                                       4.03
183      Dragon's Greatsword                             1.09
Name: Price, Length: 179, dtype: float64

In [68]:
Most_popular = pd.DataFrame({"Purchase Count":item_count,"Item Price": item_price, "Total Purchase Value":
                              item_total})

Most_popular = Most_popular.sort_values("Purchase Count", ascending=False)
Most_popular["Item Price"] = Most_popular["Item Price"].map("${:.2f}".format)
Most_popular["Total Purchase Value"] = Most_popular["Total Purchase Value"].map("${:,.2f}".format)

Most_popular.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.88,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.19,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [67]:
Most_popular = pd.DataFrame({"Purchase Count":item_count,"Item Price": item_price, "Total Purchase Value":
                              item_total})

Most_popular = Most_popular.sort_values("Total Purchase Value", ascending=False)
Most_popular["Item Price"] = Most_popular["Item Price"].map("${:.2f}".format)
Most_popular["Total Purchase Value"] = Most_popular["Total Purchase Value"].map("${:,.2f}".format)

Most_popular.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.88,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80